#!/usr/bin/env python3
# -*- coding: utf-8 -*-

"""При покупке товара на сумму от 200 до 500 руб предоставляется скидка 3%,
при покупке товара на сумму от 500 до 800 - скидка 5%,
при покупке товара на сумму от 800 до 1000 руб - скидка 7%,
свыше 1000 руб - скидка 9%.
Покупатель приобрел 8 рулонов обоев по цене Х1 и две банки краски по цене Х2. Сколько он заплатил?"""

if __name__ == '__main__':
    price_x1 = float(input("Введите цену 8 рулонов обоев: "))
    price_x2 = float(input("Введите цену 2 банок краски: "))
    summa = price_x1 + price_x2
    if 200 < summa <= 500:
        summa -= summa * 0.03
        print(f'Вы заплатили со скидкой 3% - {summa}')
    elif 500 < summa <= 800:
        summa -= summa * 0.05
        print(f'Вы заплатили со скидкой 5% - {summa}')
    elif 800 < summa <=1000:
        summa -= summa * 0.07
        print(f'Вы заплатили со скидкой 7% - {summa}')
    elif summa > 1000:
        summa -= summa * 0.09
        print(f'Вы заплатили со скидкой 9% - {summa}')
    else:
        print(f'Вы заплатили {summa}')