#Даны стороны прямоугольника. Найти его периметр и длину диагонали.
import math

a = float(input("Введите а: "))
b = float(input("Введите b: "))

P = 2 * (a + b)
l = math.sqrt(a**2 + b**2)

print("Периметр: ", P,",", "длина диагонали", l)